IDEA StatiCa Open Model
ConcreteBlockData.Id Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Plate unique ID
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public int Id { get; set; }
Public Property Id As Integer
	Get
	Set
public:
property int Id {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
ConcreteBlockData Class
IdeaRS.OpenModel.Connection Namespace